"""
Startup splash screen
"""


import time

from rich.console import Console
from rich.panel import Panel
from rich.align import Align




console=Console()



LOGO=r"""

███████╗ ██████╗  ██╗        ███████╗ █████████╗ ██████╗  ███████╗  █████╗  ███╗   ███╗
██╔════╝ ██╔══██╗ ██║        ██╔════╝ ╚══██╔══╝ ██╔══██╗ ██╔════╝ ██╔══██╗ ████╗ ████║
███████╗ ██████╔╝ ██║ ████╗  ███████╗    ██║    ██████╔╝ █████╗   ███████║ ██╔████╔██║
╚════██║ ██╔═══╝  ██║ ╚═══╝  ╚════██║    ██║    ██╔══██╗ ██╔══╝   ██╔══██║ ██║╚██╔╝██║
███████║ ██║      ██║        ███████║    ██║    ██║  ██║ ███████╗ ██║  ██║ ██║ ╚═╝ ██║
╚══════╝ ╚═╝      ╚═╝        ╚══════╝    ╚═╝    ╚═╝  ╚═╝ ╚══════╝ ╚═╝  ╚═╝ ╚═╝     ╚═╝

"""





def show_splash():


    console.clear()



    text=(

        LOGO

        +

        """

Made By @arushmangalambajpai


Based on:

Trusted Computing Group TPM Specifications

&

tpmstream


Loading SPI-STREAM Engine...

"""

    )



    console.print(

        Panel(

            Align.center(text),

            border_style="green"

        )

    )



    time.sleep(3)



    console.clear()